Revit 2027 API
ProfilePlaneLocation Enumeration
Indicates the location of Sweep profile plane on the path curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ProfilePlaneLocation
Public Enumeration ProfilePlaneLocation
public enum class ProfilePlaneLocation
type ProfilePlaneLocation
Members
Member name | Value | Description
End | 2 | Indicates the profile plane located at the End of the path curve.
MidPoint | 1 | Indicates the profile plane located at the Middle point of the path curve.
Start | 0 | Indicates the profile plane located at the start of the path curve.
Remarks
Use this enum in the NewSweep() method to create generic forms.
See Also
Reference
Autodesk.Revit.DB Namespace